---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.KeyBasedTreeEntryFailures.BadClassificationLevel
source: html/91c25df5-078c-de36-76c7-6520d65882cc.htm
---
# Autodesk.Revit.DB.BuiltInFailures.KeyBasedTreeEntryFailures.BadClassificationLevel Property

Level [Level] of Classification [Code] is not an integer from 1 to 5.

## Syntax (C#)
```csharp
public static FailureDefinitionId BadClassificationLevel { get; }
```